SET @old_query_error = @@global.general_log_query_error;
SELECT @old_query_error;
@old_query_error
0
SET @@global.general_log_query_error = DEFAULT;
SELECT @@global.general_log_query_error;
@@global.general_log_query_error
0
# general_log_query_error is a global variable.
SET @@session.general_log_query_error = 0;
ERROR HY000: Variable 'general_log_query_error' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@general_log_query_error;
@@general_log_query_error
0
SET @@global.general_log_query_error = -1;
ERROR 42000: Variable 'general_log_query_error' can't be set to the value of '-1'
SELECT @@global.general_log_query_error;
@@global.general_log_query_error
0
SET @@global.general_log_query_error = 168;
ERROR 42000: Variable 'general_log_query_error' can't be set to the value of '168'
SELECT @@global.general_log_query_error;
@@global.general_log_query_error
0
SET @@global.general_log_query_error = 10000.01;
ERROR 42000: Incorrect argument type to variable 'general_log_query_error'
SET @@global.general_log_query_error = 'test';
ERROR 42000: Variable 'general_log_query_error' can't be set to the value of 'test'
SELECT @@global.general_log_query_error;
@@global.general_log_query_error
0
SET @@global.general_log_query_error = ON;
SELECT @@global.general_log_query_error;
@@global.general_log_query_error
1
SET @@global.general_log_query_error = @old_query_error;
SELECT @@global.general_log_query_error;
@@global.general_log_query_error
0
